#+TITLE: Emacs configuration
#+SETUPFILE: https://raw.githubusercontent.com/PaddyCo/org-html-themes/master/setup/theme-readtheorg.setup
This is my personal Emacs configuration file

** Solaire mode
   Brightens source buffers and dims non-source buffers
   
   #+BEGIN_SRC emacs-lisp
   (use-package solaire-mode
     :ensure t
     :hook
     ((change-major-mode after-revert ediff-prepare-buffer) . turn-on-solaire-mode)
     (minibuffer-setup . solaire-mode-in-minibuffer)
     :config
     (solaire-global-mode +1)
     (solaire-mode-swap-bg))
   #+END_SRC

   #+RESULTS:
   | solaire-mode-in-minibuffer | rfn-eshadow-setup-minibuffer | minibuffer-history-isearch-setup | minibuffer-history-initialize |

*** Capture templates
    
    #+BEGIN_SRC emacs-lisp
    (setq org-capture-templates
      '(("t" "Todo" entry (file+headline "~/Dropbox/Org/home.org" "Capture")
             "* TODO %^{Description}\n  -  %?\n  :LOGBOOK:\n  - Added: %U\n  :END:")
	("d" "Daily task" checkitem (file+olp+datetree "~/Dropbox/Org/daily.org")
             "- [ ] %? %a %U")
        ("j" "Journal" item (file+olp+datetree "~/Dropbox/Org/journal.org")
             "- %? %U")))
    #+END_SRC

    #+RESULTS:
    | t | Todo | entry | (file+headline ~/Dropbox/Org/home.org Capture) | * TODO %^{Description} |
   
